<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Enable / Disable auto save
    |--------------------------------------------------------------------------
    |
    | Auto-save every time the application shuts down
    |
    */
    'auto_save' => false,

    /*
    |--------------------------------------------------------------------------
    | Setting driver
    |--------------------------------------------------------------------------
    |
    | Select where to store the settings.
    |
    | Supported: "database", "json"
    |
    */
    'driver' => env('SETTINGS_STORE', 'json'),

    /*
    |--------------------------------------------------------------------------
    | Database driver
    |--------------------------------------------------------------------------
    |
    | Options for database driver. Enter which connection to use, null means
    | the default connection. Set the table and column names.
    |
    */
    'database' => [
        'connection' => null,
        'table' => 'settings',
        'key' => 'key',
        'value' => 'value',
    ],

    /*
    |--------------------------------------------------------------------------
    | JSON driver
    |--------------------------------------------------------------------------
    |
    | Options for json driver. Enter the full path to the .json file.
    |
    */
    'json' => [
        'path' => storage_path().'/settings.json',
    ],

    /*
    |--------------------------------------------------------------------------
    | Override application config values
    |--------------------------------------------------------------------------
    |
    | If defined, settings package will override these config values.
    |
    | Sample:
    |   "app.locale" => "settings.locale",
    |
    */
    'override' => [

    ],

    /*
    |--------------------------------------------------------------------------
    | Required Extra Columns
    |--------------------------------------------------------------------------
    |
    | The list of columns required to be set up
    |
    | Sample:
    |   "user_id",
    |   "tenant_id",
    |
    */
    'required_extra_columns' => [

    ],

    /*
    |--------------------------------------------------------------------------
    | Package specific settings
    |--------------------------------------------------------------------------
    */
    'package' => [
        'pick_up_times' => env('PICK_UP_TIMES') ? explode(',', env('PICK_UP_TIMES')) : [
            '08:00',
            '09:00',
            '10:00',
        ],
        'disable_pickup_dates' => env('DISABLE_PICKUP_DATES') ? explode(',', env('DISABLE_PICKUP_DATES')) : [
            '12-25',
            '09-30',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Characters to be disabled in input fields
    |--------------------------------------------------------------------------
    */
    'disable_characters' => env('DISABLE_CHARACTERS') ? explode(',', env('DISABLE_CHARACTERS')) : [],

    /*
    |--------------------------------------------------------------------------
    | Prefecture to Zone mapping
    |--------------------------------------------------------------------------
    */
    'prefecture_mapping' => [
        '沖縄県' => 'Ｊ１', '熊本県' => 'Ｊ２', '宮崎県' => 'Ｊ２', '鹿児島県' => 'Ｊ２', '福岡県' => 'Ｊ３',
        '佐賀県' => 'Ｊ３', '大分県' => 'Ｊ３', '長崎県' => 'Ｊ３', '徳島県' => 'Ｊ４', '香川県' => 'Ｊ４',
        '愛媛県' => 'Ｊ４', '高知県' => 'Ｊ４', '鳥取県' => 'Ｊ５', '島根県' => 'Ｊ５', '岡山県' => 'Ｊ５',
        '広島県' => 'Ｊ５', '山口県' => 'Ｊ５', '京都府' => 'Ｊ６', '滋賀県' => 'Ｊ６', '大阪府' => 'Ｊ６',
        '兵庫県' => 'Ｊ６', '奈良県' => 'Ｊ６', '和歌山県' => 'Ｊ６', '富山県' => 'Ｊ７', '石川県' => 'Ｊ７',
        '福井県' => 'Ｊ７', '静岡県' => 'Ｊ８', '愛知県' => 'Ｊ８', '岐阜県' => 'Ｊ８', '三重県' => 'Ｊ８',
        '新潟県' => 'Ｊ９', '長野県' => 'Ｊ９', '神奈川県' => 'Ｊ１０', '東京都' => 'Ｊ１０', '山梨県' => 'Ｊ１０',
        '埼玉県' => 'Ｊ１０', '千葉県' => 'Ｊ１０', '茨城県' => 'Ｊ１０', '栃木県' => 'Ｊ１０', '群馬県' => 'Ｊ１０',
        '宮城県' => 'Ｊ１１', '山形県' => 'Ｊ１１', '福島県' => 'Ｊ１１', '青森県' => 'Ｊ１２', '秋田県' => 'Ｊ１２',
        '岩手県' => 'Ｊ１２', '北海道' => 'Ｊ１３',
    ],
];
